import { Categories, Tags, Provinces, Cities, CooperationTypes } from "@prisma/client"
import { v4 as uuid } from "uuid"

export const CATEGORIES: Categories[] = [
  { id: uuid(), name: "برنامه نویسی" },
  { id: uuid(), name: "گرافیک" },
  { id: uuid(), name: "مارکتینگ" }
]

export const TAGS: Tags[] = [
  { id: uuid(), name: "فرانت اند", category_id: CATEGORIES[0].id },
  { id: uuid(), name: "بک اند", category_id: CATEGORIES[0].id },
  { id: uuid(), name: "فول استک", category_id: CATEGORIES[0].id },
  { id: uuid(), name: "هوش مصنوعی", category_id: CATEGORIES[0].id },
  { id: uuid(), name: "کارشناس DevOps", category_id: CATEGORIES[0].id },
  { id: uuid(), name: "موبایل android", category_id: CATEGORIES[0].id },
  { id: uuid(), name: "موبایل ios", category_id: CATEGORIES[0].id },

  { id: uuid(), name: "طراح رابط کاربری", category_id: CATEGORIES[1].id },
  { id: uuid(), name: "طراح لوگو", category_id: CATEGORIES[1].id },
  { id: uuid(), name: "طراح سه بعدی", category_id: CATEGORIES[1].id },
  { id: uuid(), name: "فتوشاپ", category_id: CATEGORIES[1].id },
  { id: uuid(), name: "طراح مانگا", category_id: CATEGORIES[1].id },

  { id: uuid(), name: "دیجیتال مارکتر", category_id: CATEGORIES[2].id },
  { id: uuid(), name: "وب مستر", category_id: CATEGORIES[2].id },
  { id: uuid(), name: "سئو", category_id: CATEGORIES[2].id },
  { id: uuid(), name: "فیسبوک ads", category_id: CATEGORIES[2].id },
  { id: uuid(), name: "بازاریاب", category_id: CATEGORIES[2].id },
]

export const PROVINCES: Provinces[] = [
  { id: uuid(), name: "خراسان رضوی" },
  { id: uuid(), name: "تهران" },
  { id: uuid(), name: "شمال" }
]

export const CITIES: Cities[] = [
  { id: uuid(), name: "مشهد", province_id: PROVINCES[0].id },
  { id: uuid(), name: "نیشابور", province_id: PROVINCES[0].id },
  { id: uuid(), name: "سبزوار", province_id: PROVINCES[0].id },

  { id: uuid(), name: "تهران", province_id: PROVINCES[1].id },
  { id: uuid(), name: "کرج", province_id: PROVINCES[1].id },
  { id: uuid(), name: "شهریار", province_id: PROVINCES[1].id },

  { id: uuid(), name: "مازندران", province_id: PROVINCES[2].id },
  { id: uuid(), name: "رشت", province_id: PROVINCES[2].id },
  { id: uuid(), name: "چالوس", province_id: PROVINCES[2].id },
  { id: uuid(), name: "انزلی", province_id: PROVINCES[2].id },
  { id: uuid(), name: "گیلان", province_id: PROVINCES[2].id },
]

export const COOPERATION_TYPES: CooperationTypes[] = [
  { id: uuid(), name: "تمام وقت" },
  { id: uuid(), name: "پاره وقت" },
  { id: uuid(), name: "پروژه ای" }
]

export const FILTER_KEYS = {
  search: "search",
  remote: "remote",
  knowledgeBased: "knowledgeBased",
  type: "type",
  salary: "salary",
  category: "category",
  tag: "tag",
  province: "province",
  city: "city",
  cooperationType: "cooperationType",
  cooperationTypeCity: "cooperationType-city",
}

export const SALARY_FILTERS: [number, number][] = [
  [0, 5],
  [0, 10],
  [10, 20],
  [20, 30],
  [30, 40],
  [40, 60],
  [60, 100],
]

export const ACCORDIONS: { title: string; text: string }[] = [
  {
    title: 'مورد اعتماد بهترین سازمان‌های ایران',
    text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.'
  },
  {
    title: 'هوشمندترین سیستم پیشنهاد و اطلاع‌رسانی شغل',
    text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.'
  },
  {
    title: 'رزومه ساز دوزبانه و استاندارد',
    text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.'
  },
  {
    title: 'بستری برای ملاقات با مدیران شرکت ها در نمایشگاه کار',
    text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.'
  },
  {
    title: 'سیستم هوشمند انطباق',
    text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.'
  },
  {
    title: 'قوی‌ترین شبکه‌های اجتماعی در بین سایت‌های کاریابی ایرانی',
    text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.'
  }
]

export const FOOTER_ACCORDIONS: { title: string; text: string }[] = [
  {
    title: 'سایت استخدامی جاب ویژن، چه مزیتی نسبت به دیگر سایت‌های کاریابی و استخدامی دارد؟',
    text: 'وبسایت جاب ویژن با بیش از 26 هزار آگهی استخدام فعال و استفاده از هوش مصنوعی برای پیشنهاد مرتبط‌ترین آگهی‌ها به کارجویان، فرایند کاریابی را بسیار آسان‌تر کرده است.'
  },
  {
    title: 'آیا ساخت و ارسال رزومه در جاب ویژن برای من هزینه‌ای دارد؟',
    text: 'خیر، کارجویان می‌توانند بدون پرداخت هیچ هزینه‌ای در سایت کاریابی جاب ویژن رزومه بسازند و برای آگهی‌های استخدام ارسال کنند.'
  },
  {
    title: 'چگونه می‌توانم آگهی‌های استخدام مشاغل مرتبط با خودم را پیدا کنم؟',
    text: 'شما می‌توانید به راحتی با استفاده از نوار جستجوی بالای سایت و انتخاب فیلترهای مختلف، آگهی‌های استخدامی حوزه مرتبط با خودتان را پیدا کنید.'
  },
]

export const FOOTER_LINKS: { title: string; links: { title: string; link: string }[] }[] = [
  {
    title: 'کارجویان',
    links: [
      { title: 'رزومه ساز دو زبانه', link: '/' },
      { title: 'جستجوی فرصت‌های شغلی', link: '/' },
      { title: 'آزمون‌های خود شناسی', link: '/' },
      { title: 'رزومه ساز دو زبانه', link: '/' },
    ]
  },
  {
    title: 'کارفرمایان',
    links: [
      { title: 'ثبت آگهی جدید', link: '/' },
      { title: 'جستجوی بانک رزومه', link: '/' },
      { title: 'ثبت آگهی جدید', link: '/' },
      { title: 'جستجوی بانک رزومه', link: '/' },
    ]
  },
  {
    title: 'درباره جاب‌ویژن',
    links: [
      { title: 'درباره ما', link: '/' },
      { title: 'سوالات متداول', link: '/' },
      { title: 'تماس با ما', link: '/' },
      { title: 'قوانین و مقررات', link: '/' },
      { title: 'تماس با ما', link: '/' },
    ]
  },
]